package days01;

/**
 * @author An
 * @date 2026. 5. 11. 오후 4:25:53 
 * @subject 자바 프로그램의 기본 구조 설명
 * @content 클래스, main메서드(함수)
 * 
 */ 

public class Ex02 {

	public static void main(String[] args) { // 프로그램 시작
	
		/*
		 * 1. 자바는 객체 지향 프로그래밍 언어이기 때문에 반드시 
		      프로그램의 시작을 하는 시작개체(==객체,클래스,물건)가 필요하다.
		 * 
		 * 2. 자바에서는 클래스 선언 형식
		 * 		[접근지정자]  클래스 선언 예약어  클래스명{}
		 * 		 public      class        Ex02{
		 *      }
		 *     - 클래스명 == 자바파일명 동일
		 *     - 클래스명은 대문자로 시작한다
		 *  
		 *  3. 프로그램의 시작/종료(진입점)하는 기능의 함수(메서드)가 필요하다.
		 *  	- main메서드(함수)
		 *  3-2.
		 *  	java Sample 실행
		 *  	Ctrl + F11 실행 -> 시작개체(main) -> main 메서드 실행
		 * 
		 *  4. 자바에서 메서드(함수) 선언 형식
		 *             Modifiers == 한정자
		 *    [접근지정자] [기타제어자] 리턴자료형 메서드명(매개변수){}
		 *  	public    static    void   main(String[] args){
		 *  
		 *  	 [return 반환값;]
		 *  }
		 *  
		 *  4-2. 메서드(함수) 3가지
		 *  	1) 기능(main) : 프로그램을 시작/종료의 기능을 하는 함수
		 *   	2) 매개변수  
		 * 		3) 반환값(리턴값)  
		 *  
		 * */ 
	} // 프로그램 종료

}
