package days03;

/**
 * @author An
 * @date 2026. 5. 13. 오전 11:49:04 
 * @subject 실수 표현 방법
 * @content float(4) double(8)
 *
 */
public class Ex01_05 {

	public static void main(String[] args) {
		
		// Type mismatch: cannot convert from double to float
		float f = 0.625f;
		
		 /*
	       * [ 실수 -> 2진수 표현 ]
	       * 0.625 X 2 = [1].25 ↓
	       * 0.25  X 2 = [0].5
	       * 0.5   X 2 = [1].0
	       * 
	       * 0.625 실수 -> 0.101(2)
	       * 
	       * [문제점]
	       * 0.123456 유한실수
	       * 0.00011111100110101101101111100110101101101111001101011011011110011010110110111100110101101101...
	       * 
	       *  [실제예제]
	       * 3.14 실수
	       * 11.101011100...
	       * 1.1101011100...E1
	       * 9.123456 실수 -> 2진수 표현
	       * 1001.00011111100110101101101111100110101101101111001101011011011110011010110110111100110101101101...
	       * 
	       * 1.0010001111110011010110110111110...E3 
	       * float(4) : [부호비트1][ 8비트 E(지수부) ][ 23비트 M(가수부) 0001111110011010110110] 
	       * double(8): [부호비트1][ 11비트 E(지수부) ][ 52비트 M(가수부) ]
	       * 
	       */
		
		
	}//main

}//class
