	package days11;

/**
 * @author An
 * @date 2026. 5. 26. 오전 9:03:23 
 * @subject 
 * @content 
 *
 */
public class Ex01 {

	public static void main(String[] args) {
		/*
		 * 
		 * 1. 객체 지향 프로그래밍 (Objective Oriented Programming)
		 *      ㄴ 객체 들을 만들고 조립해서 프로그래밍하는 기법
		 * 
		 * 2. 객체(Object): 물리적,개념적으로 존재하는 것 중 다른 것과 식별 가능 한 것
		 * 
		 * 3. 객체 = 속성(필드)   +  동작(메서드)
		 * 			ㄴ 물건의 특징   ㄴ 일,기능
		 * 
		 * 예) 
		 * 완성된 컴퓨터 조립 = 부품 + 부품 + 부품 + 부품 + ...
		 *                  설계도
		 * 	  소프트웨어 조립 = 부품 + 부품 + 부품 + 부품 + ...
		 * 	                클래스
		 * 
		 * 4. 객체(클래스) 간의 관계
		 *   1) 집합 관계 :  자동차(객체)  <-  엔진(객체)
		 *   2) 상속 관계 :  객체와 객체간의 필드와 메소드를 나눠주는 관계
		 *   
		 * 5. 객체 지향 프로그래밍의 특징 ( == 클래스의 특징)
		 * 	 1) 캡슐화
		 *    (은닉화)
		 *   2) 상속성
		 *   3) 다형성 : 같은 명령을 내렸는데 대상에 따라 다른 결과가 나오는것
		 *   4) 추상화
		 *   
		 * 6. 클래스 : 객체의 설계도
		 *   
		 * 7. 인스턴스 : 클래스를 보고 실제 객체를 생성한것   
		 *   			인스턴스화
		 * 
		 * 8. 클래스 선언
		 * 	  ㄴ 필드 + 메소드 선언
		 *    ㄴ Sample.java == 동일한 Sample 클래스명
		 * 	  ㄴ 클래스 선언 형식
		 *     	접근지정자 + 기타제어자 = modifiers(제어자)
		 *      [접근지정자] [기타제어자] class 클래스명 [extends 부모클래스] [implements 인터페이스...]{
		 *      	멤버 == 객체(클래스)의 구성 요소
		 *          1) 필드  (변수)  , 속성 (특징)
		 *          2) 메소드 (함수) , 동작 (기능,일)
		 *          3) 생성자
		 *       }
		 * 
		 * 9. 객체 모델링 (Object Modeling) : 현실 세계의 객체를 소프트웨어 객체로 설계하는 과정
		 * 
		 * 10. 클래스 설계하는 과정
		 *   1) 객체의 구성요소(속성,동작) 파악 -> 목록 작성 
		 *	 2) 객체 모델링 - 필드, 메서드 작성
		 * 	 3) 클래스 선언 
		 * 	 4) 객체 생성 - 테스트
		 *   5) 문제점 파악 - 유지 보수
		 * 	 6) 상용화
		 *   7) 기능추가, 또 다른 문제점 파악 - 유지 보수
		 * 
		 * 11. 신형 자동차 클래스 설계, Car.java
		 * 
		 * 12. 필드는 초기화 하지 않아도 객체가 생성될때 자료형의 기본값으로 초기화된다
		 */

		
	}

}
